{
  "lastUpdate": "2025-10-21",
  "changelog": {
    "1.0.0": ["Initial release."],
    "1.0.1": [
      "Improvement: Updated star selection behavior on the My Characters page."
    ],
    "1.1.0": [
      "New: Introduced 'Allow Overlap' option to allow or prevent characters from being assigned to multiple teams within the same destination in step 3 of the recommendation process."
    ],
    "1.2.0": [
      "New: Introduced 'Braindead Mode' to automatically generate the two strongest non-overlapping teams for each destination in step 3 of the recommendation process."
    ],
    "1.3.0": [
      "New: Added a modal to display the current version and changelog.",
      "Improvement: Reversed the order of the Rank dropdown on the My Characters page."
    ],
    "1.3.1": [
      "Improvement: Refined the 'Braindead Mode' algorithm to optimize team recommendations in step 3."
    ],
    "1.3.2": ["Improvement: Added images of rarities & factions."],
    "1.3.3": ["Improvement: Added total inactive bonuses in step 2 & 4."],
    "1.4.0": [
      "Improvement: Increased recommendation modal width.",
      "Improvement: Reworked calculation process when team has 5 characters (unlocked by reaching lighthouse 33)."
    ],
    "1.4.1": [
      "Improvement: Replaced generic icons with Sword of Convallaria–themed ones for better consistency across the app."
    ],
    "1.4.2": [
      "New: Character names are now included when exporting or importing data on the My Characters page."
    ],
    "1.4.3": ["New: Added strategy tips to step 3."],
    "1.4.4": [
      "Fix: Characters with 0 stars are now excluded from the JSON export."
    ],
    "1.5.0": [
      "New: You can now sort your characters by Stars or Rank in My Characters.",
      "Fix: Logistics power values now display correctly."
    ],
    "1.5.1": ["New: Added Samantha - Everglow."],
    "1.6.0": ["New: Added event calendar."],
    "1.6.1": [
      "Fix: Favicon not displaying on the events page.",
      "Fix: Incorrect end date for the guild event 'Eternum Star Monument'."
    ],
    "1.6.2": ["New: Added Credenza."],
    "1.6.3": ["New: Added Camelot."]
  }
}
